_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 32, 32, 3)         0         
_________________________________________________________________
conv_1 (Conv2D)              (None, 32, 32, 6)         456       
_________________________________________________________________
maxpooling1 (MaxPooling2D)   (None, 16, 16, 6)         0         
_________________________________________________________________
conv_2 (Conv2D)              (None, 16, 16, 16)        2416      
_________________________________________________________________
maxpooling2 (MaxPooling2D)   (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 120)               123000    
_________________________________________________________________
dense_2 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_3 (Dense)              (None, 10)                850       
=================================================================
Total params: 136,886
Trainable params: 136,886
Non-trainable params: 0
_________________________________________________________________