_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 32, 32, 3)         0         
_________________________________________________________________
conv11 (Conv2D)              (None, 32, 32, 64)        1792      
_________________________________________________________________
conv12 (Conv2D)              (None, 32, 32, 64)        36928     
_________________________________________________________________
maxpooling1 (MaxPooling2D)   (None, 16, 16, 64)        0         
_________________________________________________________________
conv_21 (Conv2D)             (None, 16, 16, 128)       73856     
_________________________________________________________________
conv_22 (Conv2D)             (None, 16, 16, 128)       147584    
_________________________________________________________________
maxpooling2 (MaxPooling2D)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv_31 (Conv2D)             (None, 8, 8, 256)         295168    
_________________________________________________________________
conv_32 (Conv2D)             (None, 8, 8, 256)         590080    
_________________________________________________________________
maxpooling3 (MaxPooling2D)   (None, 4, 4, 256)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                40970     
=================================================================
Total params: 1,186,378
Trainable params: 1,186,378
Non-trainable params: 0
_________________________________________________________________