_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 32, 32, 3)         0         
_________________________________________________________________
conv_1 (Conv2D)              (None, 8, 8, 96)          34944     
_________________________________________________________________
maxpooling1 (MaxPooling2D)   (None, 4, 4, 96)          0         
_________________________________________________________________
conv_2 (Conv2D)              (None, 4, 4, 256)         614656    
_________________________________________________________________
maxpooling2 (MaxPooling2D)   (None, 2, 2, 256)         0         
_________________________________________________________________
conv_3 (Conv2D)              (None, 2, 2, 384)         885120    
_________________________________________________________________
conv_4 (Conv2D)              (None, 2, 2, 384)         1327488   
_________________________________________________________________
conv_5 (Conv2D)              (None, 2, 2, 256)         884992    
_________________________________________________________________
maxpooling3 (MaxPooling2D)   (None, 1, 1, 256)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              1052672   
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dropout_2 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                40970     
=================================================================
Total params: 21,622,154
Trainable params: 21,622,154
Non-trainable params: 0
_________________________________________________________________