_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 32, 32, 3)         0         
_________________________________________________________________
conv11 (Conv2D)              (None, 32, 32, 64)        1792      
_________________________________________________________________
conv12 (Conv2D)              (None, 32, 32, 64)        36928     
_________________________________________________________________
maxpool1 (MaxPooling2D)      (None, 16, 16, 64)        0         
_________________________________________________________________
conv21 (Conv2D)              (None, 16, 16, 128)       73856     
_________________________________________________________________
conv22 (Conv2D)              (None, 16, 16, 128)       147584    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 8, 8, 128)         0         
_________________________________________________________________
conv31 (Conv2D)              (None, 8, 8, 256)         295168    
_________________________________________________________________
conv32 (Conv2D)              (None, 8, 8, 256)         590080    
_________________________________________________________________
conv33 (Conv2D)              (None, 8, 8, 256)         590080    
_________________________________________________________________
maxpool3 (MaxPooling2D)      (None, 4, 4, 256)         0         
_________________________________________________________________
conv41 (Conv2D)              (None, 4, 4, 512)         1180160   
_________________________________________________________________
conv42 (Conv2D)              (None, 4, 4, 512)         2359808   
_________________________________________________________________
conv43 (Conv2D)              (None, 4, 4, 512)         2359808   
_________________________________________________________________
maxpool4 (MaxPooling2D)      (None, 2, 2, 512)         0         
_________________________________________________________________
conv51 (Conv2D)              (None, 2, 2, 512)         2359808   
_________________________________________________________________
conv52 (Conv2D)              (None, 2, 2, 512)         2359808   
_________________________________________________________________
conv53 (Conv2D)              (None, 2, 2, 512)         2359808   
_________________________________________________________________
maxpool5 (MaxPooling2D)      (None, 1, 1, 512)         0         
_________________________________________________________________
Flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              2101248   
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
output (Dense)               (None, 10)                40970     
=================================================================
Total params: 33,638,218
Trainable params: 33,638,218
Non-trainable params: 0
_________________________________________________________________